blog/on-defining-keys.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-05 Mon 17:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On Defining Keys In Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">On Defining Keys In Emacs</h1>
<div id="outline-container-org540a36d" class="outline-2">
<h2 id="org540a36d"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs is extremely flexible with respect to letting you bind keys to
commands.
Interestingly, and perhaps because of its history tracing back to
<i>keyboard macros</i>,  <b>naming</b> the key you wish to bind is not so
straight-forward as it appears on the surface. Here are things I've
used and learnt over the last 30 years of Emacs hackery:
</p>

<ol class="org-ol">
<li>The most basic way of naming a key is via a string of the form
<i>\C-a</i> or <i>\M-\C-a</i> where <i>\C</i> denotes the <i>Control Modifier</i>.</li>
<li>This notation gets unwieldy fast when using multiple modifiers as
in the <i>\M-\C-a</i> example.</li>
<li>It gets worse, under X, you can bind <i>\C- / for /Control Space</i>
&#x2014; notice that the space character here which is easy to miss as
white-space is significant.</li>
<li>The <i>\&lt;modifier&gt;-char</i> notation mostly appears to date back to
the age of the terminal emulator (tty), so for example, it cannot
denote <i>Control+Right</i> for example.</li>
<li>The Emacs and Elisp info manuals recommend using function <i>kbd</i>
for this reason, this function on the surface provides a unified
interface for naming keys.</li>
</ol>

<p>
If you look no further, you remain happy, but &#x2026;
</p>
</div>
</div>

<div id="outline-container-org44745fc" class="outline-2">
<h2 id="org44745fc"><span class="section-number-2">2</span> Function <code>kbd</code></h2>
<div class="outline-text-2" id="text-2">
<p>
But if you do peel the onion, here is what you  find:
</p>
<ol class="org-ol">
<li>Function <code>kbd</code>  does nothing more than calling function
<code>read-kbd-macro</code>.</li>
<li>Function <code>read-kbd-macro</code> documents itself as <i>reading the region</i>
as a  <i>keyboard macro</i>.</li>
<li>The above overloading is  achieved  by the call to function <code>edmacro-parse-keys</code>.</li>
<li>And finally we reach the scary core of the onion that is
sufficient to make your eyes water!</li>
<li>Function <code>edmacro-parse-keys</code> is an inscrutable piece of code
that  both looks extremely clever and magical and like all clever
code, feels fragile.</li>
</ol>
</div>
</div>


<div id="outline-container-org7a9ba62" class="outline-2">
<h2 id="org7a9ba62"><span class="section-number-2">3</span> Understanding And (Hopefully) Simplifying  Function <code>kbd</code></h2>
<div class="outline-text-2" id="text-3">
<p>
  A simplified <code>ems-kbd</code> function that is free from the complexity
resulting from reading in a saved keyboard macro feels like a
worthwhile goal.
I started down this road both to understand function
<code>edmacro-parse-keys</code> &#x2014; sadly, I haven't yet found a specification
for naming all available keys outside of the implementation of that
function.
So I started  <a href="https://github.com/tvraman/emacspeak/blob/master/lisp/ems-kbd.el#L1">ems-kbd.el</a>
along with a simple test-suite to see how far I could get toward the
goal of creating an equivalent <code>kbd</code> function.
</p>
</div>

<div id="outline-container-org4416bb1" class="outline-3">
<h3 id="org4416bb1"><span class="section-number-3">3.1</span> Steps So Far</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Documented the implementation.</li>
<li>Added a simple set of tests in the file.</li>
<li>Changed <span class="underline">if</span> to <span class="underline">cond</span> or <span class="underline">when</span> as appropriate.</li>
<li>Eliminated the logic  that handled  the keyboard macro
serialization for repeated keys.</li>
<li>Removed the logic for handling invocations of
<code>execute-extended-command</code> &#x2014; otherwise known as <span class="underline">M-x</span>.</li>
<li>A lot more remains, e.g., 
<ul class="org-ul">
<li>simplifying how modifier bits are handled,</li>
<li>Simplifying how special patterns like <span class="underline">SPC</span> or <span class="underline">TAB</span> are handled.</li>
<li>And likely a lot more.</li>
</ul></li>
</ol>

<p>
An alternative approach might be to rewrite it from scratch, but that
feels intractable unless I can track down a specification for naming
keys that is  exhaustive with respect to the various conventions that
have been used over the years.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-10-05 Mon 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-10-05 Mon 17:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
